|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic_dataset.csv')

In [3]:
df.describe(include='all')

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308,295,1307,486,121.000000,745
unique,NaN,NaN,NaN,1307,2,NaN,NaN,NaN,929,263,186,3,27,NaN,369
top,NaN,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,$8.05,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,NaN,2,843,NaN,NaN,NaN,11,60,6,914,39,NaN,64
mean,654.000000,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,NaN,NaN,NaN,NaN,160.809917,NaN
std,378.020061,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,NaN,NaN,NaN,NaN,97.696922,NaN
min,0.000000,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,1.000000,NaN
25%,327.000000,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,72.000000,NaN
50%,654.000000,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,155.000000,NaN
75%,981.000000,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,NaN,NaN,NaN,NaN,256.000000,NaN
max,1308.000000,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,NaN,NaN,NaN,NaN,328.000000,NaN

In [4]:
df = pd.read_csv('titanic_dataset.csv')

In [5]:
print(df.head())

   Unnamed: 0  pclass  survived  \
0           0       1         1
1           1       1         1
2           2       1         0
3           3       1         0
4           4       1         0

                                              name  gender      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton  female  29.0000      0
1                   Allison, Master. Hudson Trevor    male   0.9167      1
2                     Allison, Miss. Helen Loraine  female   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1

   parch  ticket      fare    cabin embarked boat   body  \
0      0   24160  $211.34        B5        S    2    NaN
1      2  113781  $151.55   C22 C26        S   11    NaN
2      2  113781  $151.55   C22 C26        S  NaN    NaN
3      2  113781  $151.55   C22 C26        S  NaN  135.0
4      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [6]:
#Names of columns which are missingg atleast one value
r = df.count()
r[r < df.shape[0]].index
print()
print(df.isnull().sum())

Unnamed: 0       0
pclass           0
survived         0
name             0
gender           0
age            263
sibsp            0
parch            0
ticket           0
fare             1
cabin         1014
embarked         2
boat           823
body          1188
home.dest      564
dtype: int64

In [7]:
#Shape
print(df.shape)

(1309, 15)

In [8]:
#drop columns with more than 25% missing data
perc = len(df) * .75
r = df.dropna(thresh = perc, axis = 1)
print(r)
print()
print(r.columns)
print()
print(df.count()/1309*100)

      Unnamed: 0  pclass  survived  \
0              0       1         1
1              1       1         1
2              2       1         0
3              3       1         0
4              4       1         0
...          ...     ...       ...
1304        1304       3         0
1305        1305       3         0
1306        1306       3         0
1307        1307       3         0
1308        1308       3         0

                                                 name  gender      age  sibsp  \
0                       Allen, Miss. Elisabeth Walton  female  29.0000      0
1                      Allison, Master. Hudson Trevor    male   0.9167      1
2                        Allison, Miss. Helen Loraine  female   2.0000      1
3                Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1
...                                               ...     ...      ...    ...
1304                             Zabour, Miss. Hileni  female  14.5000      1
1305                            Zabour, Miss. Thamine  female      NaN      1
1306                        Zakarian, Mr. Mapriededer    male  26.5000      0
1307                              Zakarian, Mr. Ortin    male  27.0000      0
1308                               Zimmerman, Mr. Leo    male  29.0000      0

      parch  ticket      fare embarked
0         0   24160  $211.34         S
1         2  113781  $151.55         S
2         2  113781  $151.55         S
3         2  113781  $151.55         S
4         2  113781  $151.55         S
...     ...     ...       ...      ...
1304      0    2665   $14.45         C
1305      0    2665   $14.45         C
1306      0    2656    $7.23         C
1307      0    2670    $7.23         C
1308      0  315082    $7.88         S

[1309 rows x 11 columns]

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

Unnamed: 0    100.000000
pclass        100.000000
survived      100.000000
name          100.000000
gender        100.000000
age            79.908327
sibsp         100.000000
parch         100.000000
ticket        100.000000
fare           99.923606
cabin          22.536287
embarked       99.847212
boat           37.127578
body            9.243697
home.dest      56.913675
dtype: float64

In [9]:
perc = len(df) * .75
df.dropna(thresh = perc, axis = 1,inplace=True)
print(df.columns)
print()

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

In [10]:
# drop columns having independent values(which do not affect the survival rate)
df.drop(columns=['Unnamed: 0','name'],inplace=True)
print(df.columns)

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'embarked'],
      dtype='object')

In [11]:
# check data types of all columns
print(df.dtypes)

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [23]:
# convert price to numeric
print(df)
df.replace
print(df.fare.replace(r'\$',' ', regex=True, inplace=True))
print()
df.fare=df.fare.astype('float64')
print(df.fare.dtype)

      pclass  survived  gender      age  sibsp  parch  ticket      fare  \
0          1         1  female  29.0000      0      0   24160  $211.34
1          1         1    male   0.9167      1      2  113781  $151.55
2          1         0  female   2.0000      1      2  113781  $151.55
3          1         0    male  30.0000      1      2  113781  $151.55
4          1         0  female  25.0000      1      2  113781  $151.55
...      ...       ...     ...      ...    ...    ...     ...       ...
1304       3         0  female  14.5000      1      0    2665   $14.45
1305       3         0  female      NaN      1      0    2665   $14.45
1306       3         0    male  26.5000      0      0    2656    $7.23
1307       3         0    male  27.0000      0      0    2670    $7.23
1308       3         0    male  29.0000      0      0  315082    $7.88

     embarked
0           S
1           S
2           S
3           S
4           S
...       ...
1304        C
1305        C
1306        C
1307        C
1308        S

[1309 rows x 9 columns]
None

float64

In [32]:
# find columns still having missing/na values and also count of missing data
print(df.isna().any())
print()
print(df.isna().sum())

pclass      False
survived    False
gender      False
age          True
sibsp       False
parch       False
ticket      False
fare        False
embarked     True
dtype: bool

pclass        0
survived      0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          0
embarked      2
dtype: int64

In [35]:
# fill na with mean for fare and age column column.
df.fare.fillna(df.fare.mean(),inplace=True)
df.age.fillna(df.age.mean(),inplace=True)
print(df)
print()
print(df.isna().sum())

      pclass  survived  gender        age  sibsp  parch  ticket    fare  \
0          1         1  female  29.000000      0      0   24160  211.34
1          1         1    male   0.916700      1      2  113781  151.55
2          1         0  female   2.000000      1      2  113781  151.55
3          1         0    male  30.000000      1      2  113781  151.55
4          1         0  female  25.000000      1      2  113781  151.55
...      ...       ...     ...        ...    ...    ...     ...     ...
1304       3         0  female  14.500000      1      0    2665   14.45
1305       3         0  female  29.881135      1      0    2665   14.45
1306       3         0    male  26.500000      0      0    2656    7.23
1307       3         0    male  27.000000      0      0    2670    7.23
1308       3         0    male  29.000000      0      0  315082    7.88

     embarked
0           S
1           S
2           S
3           S
4           S
...       ...
1304        C
1305        C
1306        C
1307        C
1308        S

[1309 rows x 9 columns]

pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    2
dtype: int64

In [43]:
# drop na values for embarked column.
df.dropna(subset = ['embarked'], inplace = True)
print(df.isna().sum())

pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64

In [44]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered.csv')

In [48]:
# for survived column replace 0 with D and 1 with A
df.survived.replace( {0:'D',1:'A'} ,inplace=True)
print(df)

      pclass survived  gender        age  sibsp  parch  ticket    fare  \
0          1        A  female  29.000000      0      0   24160  211.34
1          1        A    male   0.916700      1      2  113781  151.55
2          1        D  female   2.000000      1      2  113781  151.55
3          1        D    male  30.000000      1      2  113781  151.55
4          1        D  female  25.000000      1      2  113781  151.55
...      ...      ...     ...        ...    ...    ...     ...     ...
1304       3        D  female  14.500000      1      0    2665   14.45
1305       3        D  female  29.881135      1      0    2665   14.45
1306       3        D    male  26.500000      0      0    2656    7.23
1307       3        D    male  27.000000      0      0    2670    7.23
1308       3        D    male  29.000000      0      0  315082    7.88

     embarked
0           S
1           S
2           S
3           S
4           S
...       ...
1304        C
1305        C
1306        C
1307        C
1308        S

[1307 rows x 9 columns]

In [50]:
# find the frequency of different values in survived column
print(df.survived.value_counts())

D    809
A    498
Name: survived, dtype: int64

In [55]:
# group by gender and survived and see the counts in each category
grp = df.groupby(by=["gender","survived"])
print(grp)
print()
print(grp.count())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E44FC47B08>

                 pclass  age  sibsp  parch  ticket  fare  embarked
gender survived
female A            337  337    337    337     337   337       337
       D            127  127    127    127     127   127       127
male   A            161  161    161    161     161   161       161
       D            682  682    682    682     682   682       682

In [58]:
# find different pclass and no of people in each class
gp = df.groupby(by="pclass")
print(gp.pclass.count())

pclass
1    321
2    277
3    709
Name: pclass, dtype: int64

In [74]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
df1 = df.sort_values(by='age',axis=0,ascending=False).head(5)
print(df1)
gen=df1.groupby(by='gender')
print()
print(gen.gender.count())

      pclass survived  gender   age  sibsp  parch    ticket   fare embarked
14         1        A    male  80.0      0      0     27042  30.00        S
61         1        A  female  76.0      1      0     19877  78.85        S
1235       3        D    male  74.0      0      0    347060   7.78        S
135        1        D    male  71.0      0      0  PC 17754  34.65        C
9          1        D    male  71.0      0      0  PC 17609  49.50        C

gender
female    1
male      4
Name: gender, dtype: int64

In [80]:
# find max age male and female who survived
# print(df1.age.max())
res = df[(df.survived == 'A') & (df.gender == 'male')]
print(res.nlargest(1, 'age'))

res = df[(df.survived == 'A') & (df.gender == 'female')]
print(res.nlargest(1, 'age'))

    pclass survived gender   age  sibsp  parch ticket  fare embarked
14       1        A   male  80.0      0      0  27042  30.0        S
    pclass survived  gender   age  sibsp  parch ticket   fare embarked
61       1        A  female  76.0      1      0  19877  78.85        S

In [78]:
# get average age by gender
print(df.groupby('gender').age.mean())

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [79]:
# get average age by people survived vs not-survived
print(df.groupby('survived').age.mean())

survived
A    28.974711
D    30.389368
Name: age, dtype: float64